danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
//Autogenerated file

#ifndef STM32_BUILD_DEFINES_H
#define STM32_BUILD_DEFINES_H

#if __IGNORE

#elif defined(STM32F030C6)
  #define STM32F030x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f030x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F030C6.h"

#elif defined(STM32F030C8)
  #define STM32F030x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f030x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F030C8.h"

#elif defined(STM32F030CC)
  #define STM32F030xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f030xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F030CC.h"

#elif defined(STM32F030F4)
  #define STM32F030x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f030x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F030F4.h"

#elif defined(STM32F030K6)
  #define STM32F030x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f030x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F030K6.h"

#elif defined(STM32F030R8)
  #define STM32F030x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f030x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F030R8.h"

#elif defined(STM32F030RC)
  #define STM32F030xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f030xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F030RC.h"

#elif defined(STM32F070C6)
  #define STM32F070x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f070x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F070C6.h"

#elif defined(STM32F070CB)
  #define STM32F070xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f070xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F070CB.h"

#elif defined(STM32F070F6)
  #define STM32F070x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f070x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F070F6.h"

#elif defined(STM32F070RB)
  #define STM32F070xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f070xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F070RB.h"

#elif defined(STM32F031C4)
  #define STM32F031x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f031x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F031C4.h"

#elif defined(STM32F031C6)
  #define STM32F031x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f031x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F031C6.h"

#elif defined(STM32F031E6)
  #define STM32F031x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f031x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F031E6.h"

#elif defined(STM32F031F4)
  #define STM32F031x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f031x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F031F4.h"

#elif defined(STM32F031F6)
  #define STM32F031x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f031x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F031F6.h"

#elif defined(STM32F031G4)
  #define STM32F031x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f031x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F031G4.h"

#elif defined(STM32F031G6)
  #define STM32F031x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f031x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F031G6.h"

#elif defined(STM32F031K4)
  #define STM32F031x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f031x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F031K4.h"

#elif defined(STM32F031K6)
  #define STM32F031x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f031x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F031K6.h"

#elif defined(STM32F051C4)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051C4.h"

#elif defined(STM32F051C6)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051C6.h"

#elif defined(STM32F051C8)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051C8.h"

#elif defined(STM32F051K4)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051K4.h"

#elif defined(STM32F051K6)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051K6.h"

#elif defined(STM32F051K8)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051K8.h"

#elif defined(STM32F051R4)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051R4.h"

#elif defined(STM32F051R6)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051R6.h"

#elif defined(STM32F051R8)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051R8.h"

#elif defined(STM32F051T8)
  #define STM32F051x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f051x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F051T8.h"

#elif defined(STM32F071CB)
  #define STM32F071xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f071xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F071CB.h"

#elif defined(STM32F071RB)
  #define STM32F071xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f071xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F071RB.h"

#elif defined(STM32F071V8)
  #define STM32F071xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f071xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F071V8.h"

#elif defined(STM32F071VB)
  #define STM32F071xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f071xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F071VB.h"

#elif defined(STM32F091CB)
  #define STM32F091xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f091xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F091CB.h"

#elif defined(STM32F091CC)
  #define STM32F091xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f091xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F091CC.h"

