danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F091RB)
  #define STM32F091xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f091xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F091RB.h"

#elif defined(STM32F091RC)
  #define STM32F091xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f091xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F091RC.h"

#elif defined(STM32F091VB)
  #define STM32F091xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f091xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F091VB.h"

#elif defined(STM32F091VC)
  #define STM32F091xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f091xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F091VC.h"

#elif defined(STM32F042C4)
  #define STM32F042x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f042x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F042C4.h"

#elif defined(STM32F042C6)
  #define STM32F042x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f042x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F042C6.h"

#elif defined(STM32F042F4)
  #define STM32F042x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f042x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F042F4.h"

#elif defined(STM32F042F6)
  #define STM32F042x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f042x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F042F6.h"

#elif defined(STM32F042G4)
  #define STM32F042x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f042x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F042G4.h"

#elif defined(STM32F042G6)
  #define STM32F042x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f042x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F042G6.h"

#elif defined(STM32F042K4)
  #define STM32F042x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f042x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F042K4.h"

#elif defined(STM32F042K6)
  #define STM32F042x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f042x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F042K6.h"

#elif defined(STM32F042T6)
  #define STM32F042x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f042x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F042T6.h"

#elif defined(STM32F072C8)
  #define STM32F072xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f072xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F072C8.h"

#elif defined(STM32F072CB)
  #define STM32F072xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f072xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F072CB.h"

#elif defined(STM32F072R8)
  #define STM32F072xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f072xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F072R8.h"

#elif defined(STM32F072RB)
  #define STM32F072xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f072xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F072RB.h"

#elif defined(STM32F072V8)
  #define STM32F072xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f072xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F072V8.h"

#elif defined(STM32F072VB)
  #define STM32F072xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f072xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F072VB.h"

#elif defined(STM32F038C6)
  #define STM32F038xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f038xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F038C6.h"

#elif defined(STM32F038E6)
  #define STM32F038xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f038xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F038E6.h"

#elif defined(STM32F038F6)
  #define STM32F038xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f038xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F038F6.h"

#elif defined(STM32F038G6)
  #define STM32F038xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f038xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F038G6.h"

#elif defined(STM32F038K6)
  #define STM32F038xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f038xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F038K6.h"

#elif defined(STM32F048C6)
  #define STM32F048x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f048x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F048C6.h"

#elif defined(STM32F048G6)
  #define STM32F048x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f048x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F048G6.h"

#elif defined(STM32F048T6)
  #define STM32F048x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f048x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F048T6.h"

#elif defined(STM32F058C8)
  #define STM32F058xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f058xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F058C8.h"

#elif defined(STM32F058R8)
  #define STM32F058xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f058xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F058R8.h"

#elif defined(STM32F058T8)
  #define STM32F058xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f058xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F058T8.h"

#elif defined(STM32F078CB)
  #define STM32F078xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f078xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F078CB.h"

#elif defined(STM32F078RB)
  #define STM32F078xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f078xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F078RB.h"

#elif defined(STM32F078VB)
  #define STM32F078xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f078xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F078VB.h"

#elif defined(STM32F098CC)
  #define STM32F098xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f098xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F098CC.h"

#elif defined(STM32F098RC)
  #define STM32F098xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f098xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F098RC.h"

#elif defined(STM32F098VC)
  #define STM32F098xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f098xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F098VC.h"

#elif defined(STM32F100C4)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100C4.h"

