danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F100C6)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100C6.h"

#elif defined(STM32F100C8)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100C8.h"

#elif defined(STM32F100CB)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100CB.h"

#elif defined(STM32F100R4)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100R4.h"

#elif defined(STM32F100R6)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100R6.h"

#elif defined(STM32F100R8)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100R8.h"

#elif defined(STM32F100RB)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100RB.h"

#elif defined(STM32F100RC)
  #define STM32F100xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100RC.h"

#elif defined(STM32F100RD)
  #define STM32F100xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100RD.h"

#elif defined(STM32F100RE)
  #define STM32F100xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100RE.h"

#elif defined(STM32F100V8)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100V8.h"

#elif defined(STM32F100VB)
  #define STM32F100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100VB.h"

#elif defined(STM32F100VC)
  #define STM32F100xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100VC.h"

#elif defined(STM32F100VD)
  #define STM32F100xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100VD.h"

#elif defined(STM32F100VE)
  #define STM32F100xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100VE.h"

#elif defined(STM32F100ZC)
  #define STM32F100xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100ZC.h"

#elif defined(STM32F100ZD)
  #define STM32F100xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100ZD.h"

#elif defined(STM32F100ZE)
  #define STM32F100xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f100xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F100ZE.h"

#elif defined(STM32F101C8)
  #define STM32F101xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101C8.h"

#elif defined(STM32F101CB)
  #define STM32F101xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101CB.h"

#elif defined(STM32F101C6)
  #define STM32F101x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101C6.h"

#elif defined(STM32F101R4)
  #define STM32F101x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101R4.h"

#elif defined(STM32F101R6)
  #define STM32F101x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101R6.h"

#elif defined(STM32F101R8)
  #define STM32F101xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101R8.h"

#elif defined(STM32F101RB)
  #define STM32F101xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101RB.h"

#elif defined(STM32F101RC)
  #define STM32F101xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101RC.h"

#elif defined(STM32F101RD)
  #define STM32F101xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101RD.h"

#elif defined(STM32F101RE)
  #define STM32F101xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101RE.h"

#elif defined(STM32F101RF)
  #define STM32F101xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101RF.h"

#elif defined(STM32F101RG)
  #define STM32F101xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101RG.h"

#elif defined(STM32F101T4)
  #define STM32F101x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101T4.h"

#elif defined(STM32F101T6)
  #define STM32F101x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101T6.h"

#elif defined(STM32F101T8)
  #define STM32F101xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101T8.h"

#elif defined(STM32F101TB)
  #define STM32F101xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101TB.h"

#elif defined(STM32F101V8)
  #define STM32F101xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101V8.h"

#elif defined(STM32F101VB)
  #define STM32F101xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101VB.h"

#elif defined(STM32F101VC)
  #define STM32F101xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101VC.h"

#elif defined(STM32F101VD)
  #define STM32F101xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101VD.h"

#elif defined(STM32F101VE)
  #define STM32F101xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101VE.h"

