danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F101VF)
  #define STM32F101xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101VF.h"

#elif defined(STM32F101VG)
  #define STM32F101xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101VG.h"

#elif defined(STM32F101ZC)
  #define STM32F101xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101ZC.h"

#elif defined(STM32F101ZD)
  #define STM32F101xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101ZD.h"

#elif defined(STM32F101ZE)
  #define STM32F101xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101ZE.h"

#elif defined(STM32F101ZF)
  #define STM32F101xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101ZF.h"

#elif defined(STM32F101ZG)
  #define STM32F101xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f101xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F101ZG.h"

#elif defined(STM32F102C4)
  #define STM32F102x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f102x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F102C4.h"

#elif defined(STM32F102C6)
  #define STM32F102x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f102x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F102C6.h"

#elif defined(STM32F102C8)
  #define STM32F102xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f102xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F102C8.h"

#elif defined(STM32F102CB)
  #define STM32F102xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f102xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F102CB.h"

#elif defined(STM32F102R4)
  #define STM32F102x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f102x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F102R4.h"

#elif defined(STM32F102R6)
  #define STM32F102x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f102x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F102R6.h"

#elif defined(STM32F102R8)
  #define STM32F102xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f102xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F102R8.h"

#elif defined(STM32F102RB)
  #define STM32F102xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f102xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F102RB.h"

#elif defined(STM32F103C4)
  #define STM32F103x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103C4.h"

#elif defined(STM32F103C6)
  #define STM32F103x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103C6.h"

#elif defined(STM32F103C8)
  #define STM32F103xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103C8.h"

#elif defined(STM32F103CB)
  #define STM32F103xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103CB.h"

#elif defined(STM32F103R4)
  #define STM32F103x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103R4.h"

#elif defined(STM32F103R6)
  #define STM32F103x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103R6.h"

#elif defined(STM32F103R8)
  #define STM32F103xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103R8.h"

#elif defined(STM32F103RB)
  #define STM32F103xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103RB.h"

#elif defined(STM32F103RC)
  #define STM32F103xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103RC.h"

#elif defined(STM32F103RD)
  #define STM32F103xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103RD.h"

#elif defined(STM32F103RE)
  #define STM32F103xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103RE.h"

#elif defined(STM32F103RF)
  #define STM32F103xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103RF.h"

#elif defined(STM32F103RG)
  #define STM32F103xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103RG.h"

#elif defined(STM32F103T4)
  #define STM32F103x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103T4.h"

#elif defined(STM32F103T6)
  #define STM32F103x6 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103x6.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103T6.h"

#elif defined(STM32F103T8)
  #define STM32F103xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103T8.h"

#elif defined(STM32F103TB)
  #define STM32F103xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103TB.h"

#elif defined(STM32F103V8)
  #define STM32F103xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103V8.h"

#elif defined(STM32F103VB)
  #define STM32F103xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103VB.h"

#elif defined(STM32F103VC)
  #define STM32F103xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103VC.h"

#elif defined(STM32F103VD)
  #define STM32F103xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103VD.h"

#elif defined(STM32F103VE)
  #define STM32F103xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103VE.h"

#elif defined(STM32F103VF)
  #define STM32F103xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103VF.h"

#elif defined(STM32F103VG)
  #define STM32F103xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103VG.h"

#elif defined(STM32F103ZC)
  #define STM32F103xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103ZC.h"

#elif defined(STM32F103ZD)
  #define STM32F103xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103ZD.h"

