danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F103ZE)
  #define STM32F103xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103ZE.h"

#elif defined(STM32F103ZF)
  #define STM32F103xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103ZF.h"

#elif defined(STM32F103ZG)
  #define STM32F103xG 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f103xg.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F103ZG.h"

#elif defined(STM32F105R8)
  #define STM32F105xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f105xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F105R8.h"

#elif defined(STM32F105RB)
  #define STM32F105xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f105xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F105RB.h"

#elif defined(STM32F105RC)
  #define STM32F105xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f105xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F105RC.h"

#elif defined(STM32F105V8)
  #define STM32F105xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f105xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F105V8.h"

#elif defined(STM32F105VB)
  #define STM32F105xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f105xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F105VB.h"

#elif defined(STM32F105VC)
  #define STM32F105xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f105xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F105VC.h"

#elif defined(STM32F107RB)
  #define STM32F107xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f107xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F107RB.h"

#elif defined(STM32F107RC)
  #define STM32F107xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f107xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F107RC.h"

#elif defined(STM32F107VB)
  #define STM32F107xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f107xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F107VB.h"

#elif defined(STM32F107VC)
  #define STM32F107xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f107xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F107VC.h"

#elif defined(STM32F205RB)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205RB.h"

#elif defined(STM32F205RC)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205RC.h"

#elif defined(STM32F205RE)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205RE.h"

#elif defined(STM32F205RF)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205RF.h"

#elif defined(STM32F205RG)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205RG.h"

#elif defined(STM32F205VB)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205VB.h"

#elif defined(STM32F205VC)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205VC.h"

#elif defined(STM32F205VE)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205VE.h"

#elif defined(STM32F205VF)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205VF.h"

#elif defined(STM32F205VG)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205VG.h"

#elif defined(STM32F205ZC)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205ZC.h"

#elif defined(STM32F205ZE)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205ZE.h"

#elif defined(STM32F205ZF)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205ZF.h"

#elif defined(STM32F205ZG)
  #define STM32F205xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f205xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F205ZG.h"

#elif defined(STM32F215RE)
  #define STM32F215xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f215xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F215RE.h"

#elif defined(STM32F215RG)
  #define STM32F215xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f215xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F215RG.h"

#elif defined(STM32F215VE)
  #define STM32F215xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f215xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F215VE.h"

#elif defined(STM32F215VG)
  #define STM32F215xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f215xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F215VG.h"

#elif defined(STM32F215ZE)
  #define STM32F215xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f215xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F215ZE.h"

#elif defined(STM32F215ZG)
  #define STM32F215xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f215xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F215ZG.h"

#elif defined(STM32F207IC)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207IC.h"

#elif defined(STM32F207IE)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207IE.h"

#elif defined(STM32F207IF)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207IF.h"

#elif defined(STM32F207IG)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207IG.h"

#elif defined(STM32F207VC)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207VC.h"

#elif defined(STM32F207VE)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207VE.h"

#elif defined(STM32F207VF)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207VF.h"

#elif defined(STM32F207VG)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207VG.h"

#elif defined(STM32F207ZC)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207ZC.h"

#elif defined(STM32F207ZE)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207ZE.h"

#elif defined(STM32F207ZF)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207ZF.h"

#elif defined(STM32F207ZG)
  #define STM32F207xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f207xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F207ZG.h"

