danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F217IE)
  #define STM32F217xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f217xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F217IE.h"

#elif defined(STM32F217IG)
  #define STM32F217xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f217xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F217IG.h"

#elif defined(STM32F217VE)
  #define STM32F217xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f217xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F217VE.h"

#elif defined(STM32F217VG)
  #define STM32F217xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f217xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F217VG.h"

#elif defined(STM32F217ZE)
  #define STM32F217xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f217xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F217ZE.h"

#elif defined(STM32F217ZG)
  #define STM32F217xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f217xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F217ZG.h"

#elif defined(STM32F301C6)
  #define STM32F301x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f301x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F301C6.h"

#elif defined(STM32F301C8)
  #define STM32F301x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f301x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F301C8.h"

#elif defined(STM32F301K6)
  #define STM32F301x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f301x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F301K6.h"

#elif defined(STM32F301K8)
  #define STM32F301x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f301x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F301K8.h"

#elif defined(STM32F301R6)
  #define STM32F301x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f301x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F301R6.h"

#elif defined(STM32F301R8)
  #define STM32F301x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f301x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F301R8.h"

#elif defined(STM32F302C6)
  #define STM32F302x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302C6.h"

#elif defined(STM32F302C8)
  #define STM32F302x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302C8.h"

#elif defined(STM32F302CB)
  #define STM32F302xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302CB.h"

#elif defined(STM32F302CC)
  #define STM32F302xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302CC.h"

#elif defined(STM32F302K6)
  #define STM32F302x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302K6.h"

#elif defined(STM32F302K8)
  #define STM32F302x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302K8.h"

#elif defined(STM32F302R6)
  #define STM32F302x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302R6.h"

#elif defined(STM32F302R8)
  #define STM32F302x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302R8.h"

#elif defined(STM32F302RB)
  #define STM32F302xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302RB.h"

#elif defined(STM32F302RC)
  #define STM32F302xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302RC.h"

#elif defined(STM32F302RD)
  #define STM32F302xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302RD.h"

#elif defined(STM32F302RE)
  #define STM32F302xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302RE.h"

#elif defined(STM32F302VB)
  #define STM32F302xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302VB.h"

#elif defined(STM32F302VC)
  #define STM32F302xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302VC.h"

#elif defined(STM32F302VD)
  #define STM32F302xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302VD.h"

#elif defined(STM32F302VE)
  #define STM32F302xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302VE.h"

#elif defined(STM32F302ZD)
  #define STM32F302xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302ZD.h"

#elif defined(STM32F302ZE)
  #define STM32F302xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f302xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F302ZE.h"

#elif defined(STM32F303C6)
  #define STM32F303x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303C6.h"

#elif defined(STM32F303C8)
  #define STM32F303x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303C8.h"

#elif defined(STM32F303CB)
  #define STM32F303xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303CB.h"

#elif defined(STM32F303CC)
  #define STM32F303xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303CC.h"

#elif defined(STM32F303K6)
  #define STM32F303x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303K6.h"

#elif defined(STM32F303K8)
  #define STM32F303x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303K8.h"

#elif defined(STM32F303R6)
  #define STM32F303x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303R6.h"

