danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F303R8)
  #define STM32F303x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303R8.h"

#elif defined(STM32F303RB)
  #define STM32F303xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303RB.h"

#elif defined(STM32F303RC)
  #define STM32F303xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303RC.h"

#elif defined(STM32F303RD)
  #define STM32F303xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303RD.h"

#elif defined(STM32F303RE)
  #define STM32F303xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303RE.h"

#elif defined(STM32F303VB)
  #define STM32F303xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303VB.h"

#elif defined(STM32F303VC)
  #define STM32F303xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303VC.h"

#elif defined(STM32F303VD)
  #define STM32F303xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303VD.h"

#elif defined(STM32F303VE)
  #define STM32F303xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303VE.h"

#elif defined(STM32F303ZD)
  #define STM32F303xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303ZD.h"

#elif defined(STM32F303ZE)
  #define STM32F303xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f303xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F303ZE.h"

#elif defined(STM32F334C4)
  #define STM32F334x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f334x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F334C4.h"

#elif defined(STM32F334C6)
  #define STM32F334x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f334x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F334C6.h"

#elif defined(STM32F334C8)
  #define STM32F334x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f334x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F334C8.h"

#elif defined(STM32F334K4)
  #define STM32F334x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f334x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F334K4.h"

#elif defined(STM32F334K6)
  #define STM32F334x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f334x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F334K6.h"

#elif defined(STM32F334K8)
  #define STM32F334x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f334x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F334K8.h"

#elif defined(STM32F334R6)
  #define STM32F334x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f334x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F334R6.h"

#elif defined(STM32F334R8)
  #define STM32F334x8 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f334x8.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F334R8.h"

#elif defined(STM32F373C8)
  #define STM32F373xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f373xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F373C8.h"

#elif defined(STM32F373CB)
  #define STM32F373xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f373xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F373CB.h"

#elif defined(STM32F373CC)
  #define STM32F373xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f373xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F373CC.h"

#elif defined(STM32F373R8)
  #define STM32F373xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f373xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F373R8.h"

#elif defined(STM32F373RB)
  #define STM32F373xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f373xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F373RB.h"

#elif defined(STM32F373RC)
  #define STM32F373xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f373xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F373RC.h"

#elif defined(STM32F373V8)
  #define STM32F373xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f373xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F373V8.h"

#elif defined(STM32F373VB)
  #define STM32F373xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f373xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F373VB.h"

#elif defined(STM32F373VC)
  #define STM32F373xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f373xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F373VC.h"

#elif defined(STM32F318C8)
  #define STM32F318xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f318xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F318C8.h"

#elif defined(STM32F318K8)
  #define STM32F318xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f318xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F318K8.h"

#elif defined(STM32F328C8)
  #define STM32F328xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f328xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F328C8.h"

#elif defined(STM32F358CC)
  #define STM32F358xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f358xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F358CC.h"

#elif defined(STM32F358RC)
  #define STM32F358xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f358xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F358RC.h"

#elif defined(STM32F358VC)
  #define STM32F358xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f358xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F358VC.h"

#elif defined(STM32F378CC)
  #define STM32F378xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f378xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F378CC.h"

#elif defined(STM32F378RC)
  #define STM32F378xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f378xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F378RC.h"

#elif defined(STM32F378VC)
  #define STM32F378xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f378xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F378VC.h"

#elif defined(STM32F398VE)
  #define STM32F398xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f398xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F398VE.h"

