danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F401CB)
  #define STM32F401xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401CB.h"

#elif defined(STM32F401CC)
  #define STM32F401xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401CC.h"

#elif defined(STM32F401CD)
  #define STM32F401xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401CD.h"

#elif defined(STM32F401CE)
  #define STM32F401xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401CE.h"

#elif defined(STM32F401RB)
  #define STM32F401xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401RB.h"

#elif defined(STM32F401RC)
  #define STM32F401xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401RC.h"

#elif defined(STM32F401RD)
  #define STM32F401xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401RD.h"

#elif defined(STM32F401RE)
  #define STM32F401xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401RE.h"

#elif defined(STM32F401VB)
  #define STM32F401xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401VB.h"

#elif defined(STM32F401VC)
  #define STM32F401xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401VC.h"

#elif defined(STM32F401VD)
  #define STM32F401xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401VD.h"

#elif defined(STM32F401VE)
  #define STM32F401xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f401xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F401VE.h"

#elif defined(STM32F405OE)
  #define STM32F405xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f405xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F405OE.h"

#elif defined(STM32F405OG)
  #define STM32F405xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f405xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F405OG.h"

#elif defined(STM32F405RG)
  #define STM32F405xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f405xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F405RG.h"

#elif defined(STM32F405VG)
  #define STM32F405xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f405xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F405VG.h"

#elif defined(STM32F405ZG)
  #define STM32F405xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f405xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F405ZG.h"

#elif defined(STM32F415OG)
  #define STM32F415xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f415xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F415OG.h"

#elif defined(STM32F415RG)
  #define STM32F415xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f415xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F415RG.h"

#elif defined(STM32F415VG)
  #define STM32F415xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f415xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F415VG.h"

#elif defined(STM32F415ZG)
  #define STM32F415xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f415xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F415ZG.h"

#elif defined(STM32F407IE)
  #define STM32F407xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f407xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F407IE.h"

#elif defined(STM32F407IG)
  #define STM32F407xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f407xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F407IG.h"

#elif defined(STM32F407VE)
  #define STM32F407xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f407xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F407VE.h"

#elif defined(STM32F407VG)
  #define STM32F407xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f407xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F407VG.h"

#elif defined(STM32F407ZE)
  #define STM32F407xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f407xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F407ZE.h"

#elif defined(STM32F407ZG)
  #define STM32F407xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f407xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F407ZG.h"

#elif defined(STM32F417IE)
  #define STM32F417xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f417xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F417IE.h"

#elif defined(STM32F417IG)
  #define STM32F417xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f417xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F417IG.h"

#elif defined(STM32F417VE)
  #define STM32F417xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f417xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F417VE.h"

#elif defined(STM32F417VG)
  #define STM32F417xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f417xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F417VG.h"

#elif defined(STM32F417ZE)
  #define STM32F417xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f417xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F417ZE.h"

#elif defined(STM32F417ZG)
  #define STM32F417xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f417xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F417ZG.h"

#elif defined(STM32F410C8)
  #define STM32F410Cx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f410cx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F410C8.h"

#elif defined(STM32F410CB)
  #define STM32F410Cx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f410cx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F410CB.h"

#elif defined(STM32F410R8)
  #define STM32F410Rx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f410rx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F410R8.h"

#elif defined(STM32F410RB)
  #define STM32F410Rx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f410rx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F410RB.h"

