danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F410T8)
  #define STM32F410Tx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f410tx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F410T8.h"

#elif defined(STM32F410TB)
  #define STM32F410Tx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f410tx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F410TB.h"

#elif defined(STM32F411CC)
  #define STM32F411xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f411xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F411CC.h"

#elif defined(STM32F411CE)
  #define STM32F411xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f411xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F411CE.h"

#elif defined(STM32F411RC)
  #define STM32F411xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f411xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F411RC.h"

#elif defined(STM32F411RE)
  #define STM32F411xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f411xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F411RE.h"

#elif defined(STM32F411VC)
  #define STM32F411xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f411xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F411VC.h"

#elif defined(STM32F411VE)
  #define STM32F411xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f411xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F411VE.h"

#elif defined(STM32F412CE)
  #define STM32F412Cx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f412cx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F412CE.h"

#elif defined(STM32F412CG)
  #define STM32F412Cx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f412cx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F412CG.h"

#elif defined(STM32F412RE)
  #define STM32F412Rx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f412rx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F412RE.h"

#elif defined(STM32F412RG)
  #define STM32F412Rx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f412rx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F412RG.h"

#elif defined(STM32F412VE)
  #define STM32F412Vx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f412vx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F412VE.h"

#elif defined(STM32F412VG)
  #define STM32F412Vx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f412vx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F412VG.h"

#elif defined(STM32F412ZE)
  #define STM32F412Zx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f412zx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F412ZE.h"

#elif defined(STM32F412ZG)
  #define STM32F412Zx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f412zx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F412ZG.h"

#elif defined(STM32F427AG)
  #define STM32F427xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f427xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F427AG.h"

#elif defined(STM32F427AI)
  #define STM32F427xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f427xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F427AI.h"

#elif defined(STM32F427IG)
  #define STM32F427xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f427xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F427IG.h"

#elif defined(STM32F427II)
  #define STM32F427xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f427xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F427II.h"

#elif defined(STM32F427VG)
  #define STM32F427xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f427xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F427VG.h"

#elif defined(STM32F427VI)
  #define STM32F427xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f427xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F427VI.h"

#elif defined(STM32F427ZG)
  #define STM32F427xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f427xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F427ZG.h"

#elif defined(STM32F427ZI)
  #define STM32F427xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f427xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F427ZI.h"

#elif defined(STM32F437AI)
  #define STM32F437xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f437xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F437AI.h"

#elif defined(STM32F437IG)
  #define STM32F437xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f437xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F437IG.h"

#elif defined(STM32F437II)
  #define STM32F437xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f437xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F437II.h"

#elif defined(STM32F437VG)
  #define STM32F437xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f437xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F437VG.h"

#elif defined(STM32F437VI)
  #define STM32F437xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f437xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F437VI.h"

#elif defined(STM32F437ZG)
  #define STM32F437xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f437xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F437ZG.h"

#elif defined(STM32F437ZI)
  #define STM32F437xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f437xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F437ZI.h"

#elif defined(STM32F429AG)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429AG.h"

#elif defined(STM32F429AI)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429AI.h"

#elif defined(STM32F429BE)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429BE.h"

#elif defined(STM32F429BG)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429BG.h"

#elif defined(STM32F429BI)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429BI.h"

#elif defined(STM32F429IE)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429IE.h"

