danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F429IG)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429IG.h"

#elif defined(STM32F429II)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429II.h"

#elif defined(STM32F429NE)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429NE.h"

#elif defined(STM32F429NG)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429NG.h"

#elif defined(STM32F429NI)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429NI.h"

#elif defined(STM32F429VE)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429VE.h"

#elif defined(STM32F429VG)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429VG.h"

#elif defined(STM32F429VI)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429VI.h"

#elif defined(STM32F429ZE)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429ZE.h"

#elif defined(STM32F429ZG)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429ZG.h"

#elif defined(STM32F429ZI)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F429ZI.h"

#elif defined(STM32F439AI)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439AI.h"

#elif defined(STM32F439BG)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439BG.h"

#elif defined(STM32F439BI)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439BI.h"

#elif defined(STM32F439IG)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439IG.h"

#elif defined(STM32F439II)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439II.h"

#elif defined(STM32F439NG)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439NG.h"

#elif defined(STM32F439NI)
  #define STM32F429xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f429xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439NI.h"

#elif defined(STM32F439VG)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439VG.h"

#elif defined(STM32F439VI)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439VI.h"

#elif defined(STM32F439ZG)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439ZG.h"

#elif defined(STM32F439ZI)
  #define STM32F439xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f439xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F439ZI.h"

#elif defined(STM32F446MC)
  #define STM32F446xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f446xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F446MC.h"

#elif defined(STM32F446ME)
  #define STM32F446xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f446xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F446ME.h"

#elif defined(STM32F446RC)
  #define STM32F446xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f446xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F446RC.h"

#elif defined(STM32F446RE)
  #define STM32F446xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f446xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F446RE.h"

#elif defined(STM32F446VC)
  #define STM32F446xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f446xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F446VC.h"

#elif defined(STM32F446VE)
  #define STM32F446xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f446xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F446VE.h"

#elif defined(STM32F446ZC)
  #define STM32F446xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f446xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F446ZC.h"

#elif defined(STM32F446ZE)
  #define STM32F446xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f446xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F446ZE.h"

#elif defined(STM32F469AE)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469AE.h"

#elif defined(STM32F469AG)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469AG.h"

#elif defined(STM32F469AI)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469AI.h"

#elif defined(STM32F469BE)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469BE.h"

#elif defined(STM32F469BG)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469BG.h"

#elif defined(STM32F469BI)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469BI.h"

#elif defined(STM32F469IE)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469IE.h"

