danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F469IG)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469IG.h"

#elif defined(STM32F469II)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469II.h"

#elif defined(STM32F469NE)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469NE.h"

#elif defined(STM32F469NG)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469NG.h"

#elif defined(STM32F469NI)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469NI.h"

#elif defined(STM32F469VE)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469VE.h"

#elif defined(STM32F469VG)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469VG.h"

#elif defined(STM32F469VI)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469VI.h"

#elif defined(STM32F469ZE)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469ZE.h"

#elif defined(STM32F469ZG)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469ZG.h"

#elif defined(STM32F469ZI)
  #define STM32F469xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f469xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F469ZI.h"

#elif defined(STM32F479AG)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479AG.h"

#elif defined(STM32F479AI)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479AI.h"

#elif defined(STM32F479BG)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479BG.h"

#elif defined(STM32F479BI)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479BI.h"

#elif defined(STM32F479IG)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479IG.h"

#elif defined(STM32F479II)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479II.h"

#elif defined(STM32F479NG)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479NG.h"

#elif defined(STM32F479NI)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479NI.h"

#elif defined(STM32F479VG)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479VG.h"

#elif defined(STM32F479VI)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479VI.h"

#elif defined(STM32F479ZG)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479ZG.h"

#elif defined(STM32F479ZI)
  #define STM32F479xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f479xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F479ZI.h"

#elif defined(STM32F745IE)
  #define STM32F745xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f745xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F745IE.h"

#elif defined(STM32F745IG)
  #define STM32F745xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f745xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F745IG.h"

#elif defined(STM32F745VE)
  #define STM32F745xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f745xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F745VE.h"

#elif defined(STM32F745VG)
  #define STM32F745xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f745xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F745VG.h"

#elif defined(STM32F745ZE)
  #define STM32F745xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f745xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F745ZE.h"

#elif defined(STM32F745ZG)
  #define STM32F745xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f745xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F745ZG.h"

#elif defined(STM32F765BG)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765BG.h"

#elif defined(STM32F765BI)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765BI.h"

#elif defined(STM32F765IG)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765IG.h"

#elif defined(STM32F765II)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765II.h"

#elif defined(STM32F765NG)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765NG.h"

#elif defined(STM32F765NI)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765NI.h"

#elif defined(STM32F765VG)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765VG.h"

#elif defined(STM32F765VI)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765VI.h"

#elif defined(STM32F765ZG)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765ZG.h"

#elif defined(STM32F765ZI)
  #define STM32F765xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f765xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F765ZI.h"

#elif defined(STM32F746BE)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746BE.h"

#elif defined(STM32F746BG)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746BG.h"

#elif defined(STM32F746IE)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746IE.h"

