danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F746IG)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746IG.h"

#elif defined(STM32F746NE)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746NE.h"

#elif defined(STM32F746NG)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746NG.h"

#elif defined(STM32F746VE)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746VE.h"

#elif defined(STM32F746VG)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746VG.h"

#elif defined(STM32F746ZE)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746ZE.h"

#elif defined(STM32F746ZG)
  #define STM32F746xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f746xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F746ZG.h"

#elif defined(STM32F756BG)
  #define STM32F756xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f756xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F756BG.h"

#elif defined(STM32F756IG)
  #define STM32F756xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f756xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F756IG.h"

#elif defined(STM32F756NG)
  #define STM32F756xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f756xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F756NG.h"

#elif defined(STM32F756VG)
  #define STM32F756xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f756xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F756VG.h"

#elif defined(STM32F756ZG)
  #define STM32F756xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f756xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F756ZG.h"

#elif defined(STM32F767BG)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767BG.h"

#elif defined(STM32F767BI)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767BI.h"

#elif defined(STM32F767IG)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767IG.h"

#elif defined(STM32F767II)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767II.h"

#elif defined(STM32F767NG)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767NG.h"

#elif defined(STM32F767NI)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767NI.h"

#elif defined(STM32F767VG)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767VG.h"

#elif defined(STM32F767VI)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767VI.h"

#elif defined(STM32F767ZG)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767ZG.h"

#elif defined(STM32F767ZI)
  #define STM32F767xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f767xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F767ZI.h"

#elif defined(STM32F777BI)
  #define STM32F777xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f777xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F777BI.h"

#elif defined(STM32F777II)
  #define STM32F777xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f777xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F777II.h"

#elif defined(STM32F777NI)
  #define STM32F777xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f777xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F777NI.h"

#elif defined(STM32F777VI)
  #define STM32F777xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f777xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F777VI.h"

#elif defined(STM32F777ZI)
  #define STM32F777xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f777xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F777ZI.h"

#elif defined(STM32F768AI)
  #define STM32F769xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f769xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F768AI.h"

#elif defined(STM32F778AI)
  #define STM32F779xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f779xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F778AI.h"

#elif defined(STM32F769AG)
  #define STM32F769xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f769xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F769AG.h"

#elif defined(STM32F769AI)
  #define STM32F769xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f769xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F769AI.h"

#elif defined(STM32F769BG)
  #define STM32F769xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f769xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F769BG.h"

#elif defined(STM32F769BI)
  #define STM32F769xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f769xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F769BI.h"

#elif defined(STM32F769IG)
  #define STM32F769xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f769xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F769IG.h"

#elif defined(STM32F769II)
  #define STM32F769xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f769xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F769II.h"

#elif defined(STM32F769NG)
  #define STM32F769xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f769xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F769NG.h"

#elif defined(STM32F769NI)
  #define STM32F769xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f769xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F769NI.h"

