danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32F779AI)
  #define STM32F779xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f779xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F779AI.h"

#elif defined(STM32F779BI)
  #define STM32F779xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f779xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F779BI.h"

#elif defined(STM32F779II)
  #define STM32F779xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f779xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F779II.h"

#elif defined(STM32F779NI)
  #define STM32F779xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32f779xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32F779NI.h"

#elif defined(STM32L011D3)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011D3.h"

#elif defined(STM32L011D4)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011D4.h"

#elif defined(STM32L011E3)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011E3.h"

#elif defined(STM32L011E4)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011E4.h"

#elif defined(STM32L011F3)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011F3.h"

#elif defined(STM32L011F4)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011F4.h"

#elif defined(STM32L011G3)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011G3.h"

#elif defined(STM32L011G4)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011G4.h"

#elif defined(STM32L011K3)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011K3.h"

#elif defined(STM32L011K4)
  #define STM32L011xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l011xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L011K4.h"

#elif defined(STM32L021D4)
  #define STM32L021xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l021xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L021D4.h"

#elif defined(STM32L021F4)
  #define STM32L021xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l021xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L021F4.h"

#elif defined(STM32L021G4)
  #define STM32L021xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l021xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L021G4.h"

#elif defined(STM32L021K4)
  #define STM32L021xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l021xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L021K4.h"

#elif defined(STM32L031C4)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031C4.h"

#elif defined(STM32L031C6)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031C6.h"

#elif defined(STM32L031E4)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031E4.h"

#elif defined(STM32L031E6)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031E6.h"

#elif defined(STM32L031F4)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031F4.h"

#elif defined(STM32L031F6)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031F6.h"

#elif defined(STM32L031G4)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031G4.h"

#elif defined(STM32L031G6)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031G6.h"

#elif defined(STM32L031K4)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031K4.h"

#elif defined(STM32L031K6)
  #define STM32L031xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l031xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L031K6.h"

#elif defined(STM32L041C4)
  #define STM32L041xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l041xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L041C4.h"

#elif defined(STM32L041C6)
  #define STM32L041xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l041xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L041C6.h"

#elif defined(STM32L041F6)
  #define STM32L041xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l041xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L041F6.h"

#elif defined(STM32L041G6)
  #define STM32L041xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l041xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L041G6.h"

#elif defined(STM32L041K6)
  #define STM32L041xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l041xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L041K6.h"

#elif defined(STM32L051C6)
  #define STM32L051xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l051xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L051C6.h"

#elif defined(STM32L051C8)
  #define STM32L051xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l051xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L051C8.h"

#elif defined(STM32L051K6)
  #define STM32L051xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l051xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L051K6.h"

#elif defined(STM32L051K8)
  #define STM32L051xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l051xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L051K8.h"

#elif defined(STM32L051R6)
  #define STM32L051xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l051xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L051R6.h"

#elif defined(STM32L051R8)
  #define STM32L051xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l051xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L051R8.h"

#elif defined(STM32L051T6)
  #define STM32L051xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l051xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L051T6.h"

#elif defined(STM32L051T8)
  #define STM32L051xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l051xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L051T8.h"

