danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32L071CB)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071CB.h"

#elif defined(STM32L071CZ)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071CZ.h"

#elif defined(STM32L071C8)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071C8.h"

#elif defined(STM32L071KB)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071KB.h"

#elif defined(STM32L071KZ)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071KZ.h"

#elif defined(STM32L071K8)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071K8.h"

#elif defined(STM32L071RB)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071RB.h"

#elif defined(STM32L071RZ)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071RZ.h"

#elif defined(STM32L071VB)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071VB.h"

#elif defined(STM32L071VZ)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071VZ.h"

#elif defined(STM32L071V8)
  #define STM32L071xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l071xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L071V8.h"

#elif defined(STM32L081CZ)
  #define STM32L081xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l081xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L081CZ.h"

#elif defined(STM32L081KZ)
  #define STM32L081xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l081xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L081KZ.h"

#elif defined(STM32L052C6)
  #define STM32L052xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l052xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L052C6.h"

#elif defined(STM32L052C8)
  #define STM32L052xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l052xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L052C8.h"

#elif defined(STM32L052K6)
  #define STM32L052xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l052xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L052K6.h"

#elif defined(STM32L052K8)
  #define STM32L052xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l052xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L052K8.h"

#elif defined(STM32L052R6)
  #define STM32L052xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l052xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L052R6.h"

#elif defined(STM32L052R8)
  #define STM32L052xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l052xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L052R8.h"

#elif defined(STM32L052T6)
  #define STM32L052xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l052xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L052T6.h"

#elif defined(STM32L052T8)
  #define STM32L052xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l052xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L052T8.h"

#elif defined(STM32L062K8)
  #define STM32L062xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l062xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L062K8.h"

#elif defined(STM32L072CB)
  #define STM32L072xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l072xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L072CB.h"

#elif defined(STM32L072CZ)
  #define STM32L072xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l072xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L072CZ.h"

#elif defined(STM32L072KB)
  #define STM32L072xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l072xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L072KB.h"

#elif defined(STM32L072KZ)
  #define STM32L072xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l072xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L072KZ.h"

#elif defined(STM32L072RB)
  #define STM32L072xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l072xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L072RB.h"

#elif defined(STM32L072RZ)
  #define STM32L072xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l072xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L072RZ.h"

#elif defined(STM32L072VB)
  #define STM32L072xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l072xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L072VB.h"

#elif defined(STM32L072VZ)
  #define STM32L072xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l072xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L072VZ.h"

#elif defined(STM32L072V8)
  #define STM32L072xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l072xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L072V8.h"

#elif defined(STM32L082KB)
  #define STM32L082xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l082xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L082KB.h"

#elif defined(STM32L082KZ)
  #define STM32L082xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l082xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L082KZ.h"

#elif defined(STM32L053C6)
  #define STM32L053xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l053xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L053C6.h"

#elif defined(STM32L053C8)
  #define STM32L053xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l053xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L053C8.h"

#elif defined(STM32L053R6)
  #define STM32L053xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l053xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L053R6.h"

#elif defined(STM32L053R8)
  #define STM32L053xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l053xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L053R8.h"

#elif defined(STM32L063C8)
  #define STM32L063xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l063xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L063C8.h"

