danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32L063R8)
  #define STM32L063xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l063xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L063R8.h"

#elif defined(STM32L073CB)
  #define STM32L073xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l073xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L073CB.h"

#elif defined(STM32L073CZ)
  #define STM32L073xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l073xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L073CZ.h"

#elif defined(STM32L073RB)
  #define STM32L073xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l073xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L073RB.h"

#elif defined(STM32L073RZ)
  #define STM32L073xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l073xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L073RZ.h"

#elif defined(STM32L073VB)
  #define STM32L073xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l073xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L073VB.h"

#elif defined(STM32L073VZ)
  #define STM32L073xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l073xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L073VZ.h"

#elif defined(STM32L073V8)
  #define STM32L073xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l073xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L073V8.h"

#elif defined(STM32L083CB)
  #define STM32L083xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l083xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L083CB.h"

#elif defined(STM32L083CZ)
  #define STM32L083xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l083xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L083CZ.h"

#elif defined(STM32L083RB)
  #define STM32L083xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l083xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L083RB.h"

#elif defined(STM32L083RZ)
  #define STM32L083xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l083xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L083RZ.h"

#elif defined(STM32L083VB)
  #define STM32L083xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l083xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L083VB.h"

#elif defined(STM32L083VZ)
  #define STM32L083xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l083xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L083VZ.h"

#elif defined(STM32L083V8)
  #define STM32L083xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l083xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L083V8.h"

#elif defined(STM32L100C6)
  #define STM32L100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L100C6.h"

#elif defined(STM32L100R8)
  #define STM32L100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L100R8.h"

#elif defined(STM32L100RB)
  #define STM32L100xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l100xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L100RB.h"

#elif defined(STM32L100RC)
  #define STM32L100xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l100xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L100RC.h"

#elif defined(STM32L151C6)
  #define STM32L151xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151C6.h"

#elif defined(STM32L151C8)
  #define STM32L151xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151C8.h"

#elif defined(STM32L151CB)
  #define STM32L151xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151CB.h"

#elif defined(STM32L151CC)
  #define STM32L151xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151CC.h"

#elif defined(STM32L151QC)
  #define STM32L151xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151QC.h"

#elif defined(STM32L151QD)
  #define STM32L151xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151QD.h"

#elif defined(STM32L151QE)
  #define STM32L151xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151QE.h"

#elif defined(STM32L151R6)
  #define STM32L151xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151R6.h"

#elif defined(STM32L151R8)
  #define STM32L151xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151R8.h"

#elif defined(STM32L151RB)
  #define STM32L151xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151RB.h"

#elif defined(STM32L151RC)
  #define STM32L151xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151RC.h"

#elif defined(STM32L151RD)
  #define STM32L151xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151RD.h"

#elif defined(STM32L151RE)
  #define STM32L151xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151RE.h"

#elif defined(STM32L151UC)
  #define STM32L151xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151UC.h"

#elif defined(STM32L151V8)
  #define STM32L151xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151V8.h"

#elif defined(STM32L151VB)
  #define STM32L151xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151VB.h"

#elif defined(STM32L151VC)
  #define STM32L151xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151VC.h"

#elif defined(STM32L151VD)
  #define STM32L151xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151VD.h"

#elif defined(STM32L151VE)
  #define STM32L151xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151VE.h"

#elif defined(STM32L151ZC)
  #define STM32L151xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151ZC.h"

