danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32L151ZD)
  #define STM32L151xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151ZD.h"

#elif defined(STM32L151ZE)
  #define STM32L151xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l151xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L151ZE.h"

#elif defined(STM32L152C6)
  #define STM32L152xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152C6.h"

#elif defined(STM32L152C8)
  #define STM32L152xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152C8.h"

#elif defined(STM32L152CB)
  #define STM32L152xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152CB.h"

#elif defined(STM32L152CC)
  #define STM32L152xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152CC.h"

#elif defined(STM32L152QC)
  #define STM32L152xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152QC.h"

#elif defined(STM32L152QD)
  #define STM32L152xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152QD.h"

#elif defined(STM32L152QE)
  #define STM32L152xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152QE.h"

#elif defined(STM32L152R6)
  #define STM32L152xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152R6.h"

#elif defined(STM32L152R8)
  #define STM32L152xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152R8.h"

#elif defined(STM32L152RB)
  #define STM32L152xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152RB.h"

#elif defined(STM32L152RC)
  #define STM32L152xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152RC.h"

#elif defined(STM32L152RD)
  #define STM32L152xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152RD.h"

#elif defined(STM32L152RE)
  #define STM32L152xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152RE.h"

#elif defined(STM32L152V8)
  #define STM32L152xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152V8.h"

#elif defined(STM32L152VB)
  #define STM32L152xB 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xb.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152VB.h"

#elif defined(STM32L152VC)
  #define STM32L152xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152VC.h"

#elif defined(STM32L152VD)
  #define STM32L152xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152VD.h"

#elif defined(STM32L152VE)
  #define STM32L152xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152VE.h"

#elif defined(STM32L152ZC)
  #define STM32L152xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152ZC.h"

#elif defined(STM32L152ZD)
  #define STM32L152xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152ZD.h"

#elif defined(STM32L152ZE)
  #define STM32L152xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l152xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L152ZE.h"

#elif defined(STM32L162QD)
  #define STM32L162xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l162xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L162QD.h"

#elif defined(STM32L162RC)
  #define STM32L162xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l162xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L162RC.h"

#elif defined(STM32L162RD)
  #define STM32L162xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l162xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L162RD.h"

#elif defined(STM32L162RE)
  #define STM32L162xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l162xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L162RE.h"

#elif defined(STM32L162VC)
  #define STM32L162xC 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l162xc.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L162VC.h"

#elif defined(STM32L162VD)
  #define STM32L162xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l162xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L162VD.h"

#elif defined(STM32L162VE)
  #define STM32L162xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l162xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L162VE.h"

#elif defined(STM32L162ZD)
  #define STM32L162xD 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l162xd.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L162ZD.h"

#elif defined(STM32L162ZE)
  #define STM32L162xE 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l162xe.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L162ZE.h"

#elif defined(STM32L431CB)
  #define STM32L431xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l431xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L431CB.h"

#elif defined(STM32L431CC)
  #define STM32L431xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l431xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L431CC.h"

#elif defined(STM32L431KB)
  #define STM32L431xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l431xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L431KB.h"

#elif defined(STM32L431KC)
  #define STM32L431xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l431xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L431KC.h"

#elif defined(STM32L431RB)
  #define STM32L431xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l431xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L431RB.h"

