danieleff/STM32GENERIC/STM32/cores/arduino/stm32/stm32_build_defines.h
#elif defined(STM32L431RC)
  #define STM32L431xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l431xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L431RC.h"

#elif defined(STM32L431VC)
  #define STM32L431xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l431xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L431VC.h"

#elif defined(STM32L471QE)
  #define STM32L471xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l471xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L471QE.h"

#elif defined(STM32L471QG)
  #define STM32L471xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l471xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L471QG.h"

#elif defined(STM32L471RE)
  #define STM32L471xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l471xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L471RE.h"

#elif defined(STM32L471RG)
  #define STM32L471xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l471xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L471RG.h"

#elif defined(STM32L471VE)
  #define STM32L471xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l471xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L471VE.h"

#elif defined(STM32L471VG)
  #define STM32L471xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l471xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L471VG.h"

#elif defined(STM32L471ZE)
  #define STM32L471xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l471xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L471ZE.h"

#elif defined(STM32L471ZG)
  #define STM32L471xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l471xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L471ZG.h"

#elif defined(STM32L432KB)
  #define STM32L432xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l432xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L432KB.h"

#elif defined(STM32L432KC)
  #define STM32L432xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l432xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L432KC.h"

#elif defined(STM32L442KC)
  #define STM32L442xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l442xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L442KC.h"

#elif defined(STM32L433CB)
  #define STM32L433xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l433xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L433CB.h"

#elif defined(STM32L433CC)
  #define STM32L433xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l433xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L433CC.h"

#elif defined(STM32L433RB)
  #define STM32L433xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l433xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L433RB.h"

#elif defined(STM32L433RC)
  #define STM32L433xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l433xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L433RC.h"

#elif defined(STM32L433VC)
  #define STM32L433xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l433xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L433VC.h"

#elif defined(STM32L443CC)
  #define STM32L443xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l443xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L443CC.h"

#elif defined(STM32L443RC)
  #define STM32L443xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l443xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L443RC.h"

#elif defined(STM32L443VC)
  #define STM32L443xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l443xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L443VC.h"

#elif defined(STM32L475RC)
  #define STM32L475xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l475xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L475RC.h"

#elif defined(STM32L475RE)
  #define STM32L475xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l475xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L475RE.h"

#elif defined(STM32L475RG)
  #define STM32L475xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l475xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L475RG.h"

#elif defined(STM32L475VC)
  #define STM32L475xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l475xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L475VC.h"

#elif defined(STM32L475VE)
  #define STM32L475xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l475xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L475VE.h"

#elif defined(STM32L475VG)
  #define STM32L475xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l475xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L475VG.h"

#elif defined(STM32L485JC)
  #define STM32L485xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l485xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L485JC.h"

#elif defined(STM32L485JE)
  #define STM32L485xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l485xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L485JE.h"

#elif defined(STM32L476JE)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476JE.h"

#elif defined(STM32L476JG)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476JG.h"

#elif defined(STM32L476ME)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476ME.h"

#elif defined(STM32L476MG)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476MG.h"

#elif defined(STM32L476QE)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476QE.h"

#elif defined(STM32L476QG)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476QG.h"

#elif defined(STM32L476RC)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476RC.h"

#elif defined(STM32L476RE)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476RE.h"

#elif defined(STM32L476RG)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476RG.h"

#elif defined(STM32L476VC)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476VC.h"

#elif defined(STM32L476VE)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476VE.h"

#elif defined(STM32L476VG)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476VG.h"

#elif defined(STM32L476ZE)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476ZE.h"

#elif defined(STM32L476ZG)
  #define STM32L476xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l476xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L476ZG.h"

#elif defined(STM32L486JG)
  #define STM32L486xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l486xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L486JG.h"

#elif defined(STM32L486QG)
  #define STM32L486xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l486xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L486QG.h"

#elif defined(STM32L486RG)
  #define STM32L486xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l486xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L486RG.h"

#elif defined(STM32L486VG)
  #define STM32L486xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l486xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L486VG.h"

#elif defined(STM32L486ZG)
  #define STM32L486xx 1
  #define CMSIS_STARTUP_ASSEMBLY "startup_stm32l486xx.s"
  #define CHIP_PERIPHERAL_INCLUDE "stm32_STM32L486ZG.h"
#else 
#error UNKNOWN CHIP 
#endif

#endif